In [13]:
import pandas as pd

In [64]:
data = pd.read_csv("Employees.csv")
data.head()

   ID   Age   Salary Department  Gender
0   1  25.0  50000.0      Sales    Male
1   2  30.0      NaN  Marketing  Female
2   3  45.0  70000.0         IT    Male
3   4  28.0  52000.0        NaN  Female
4   5  35.0  58000.0      Sales     NaN

In [65]:
data.isnull().sum()

ID            0
Age           4
Salary        6
Department    3
Gender        5
dtype: int64

In [66]:
# Fill missing salary with the average salary
avg_salary = data.Salary.mean()
print(f"The average salary is: {avg_salary:.2f}")

# mean imputation
data['Salary'] = data.Salary.fillna(avg_salary)
data.isnull().sum()

The average salary is: 61500.00

ID            0
Age           4
Salary        0
Department    3
Gender        5
dtype: int64

In [67]:
# Fill missing age, department, and gender
mean_age = data.Age.mean()
dep = data.Department.mode()[0]
gender = data.Gender.mode()[0]

print(f"The average age is: {mean_age:.0f}")
print(f"The Department is: {dep}")
print(f"The most gender is: {gender}")

data['Age'] = data.Age.fillna(mean_age)
data['Department'] = data.Department.fillna(dep)
data['Gender'] = data.Gender.fillna(gender)

The average age is: 36
The Department is: Sales
The most gender is: Female

In [68]:
data.head()

   ID   Age   Salary Department  Gender
0   1  25.0  50000.0      Sales    Male
1   2  30.0  61500.0  Marketing  Female
2   3  45.0  70000.0         IT    Male
3   4  28.0  52000.0      Sales  Female
4   5  35.0  58000.0      Sales  Female

In [69]:
data.isnull().sum()

ID            0
Age           0
Salary        0
Department    0
Gender        0
dtype: int64

In [76]:
# Imputing using mean from SimpleImputer
from sklearn.impute import SimpleImputer
# Sample data
d = {
    'Age': [25, 30, None, 45],
    'Salary': [50000, None, 60000, 80000]
}
df = pd.DataFrame(d)
# Impute missing values with mean
imputer = SimpleImputer(strategy='mean')
df.iloc[:, :] = imputer.fit_transform(df)
df

         Age        Salary
0  25.000000  50000.000000
1  30.000000  63333.333333
2  33.333333  60000.000000
3  45.000000  80000.000000

In [86]:
from sklearn.impute import KNNImputer

ddf = {
    'Age': [25, 30, None, 45],
    'Salary': [50000, None, 60000, 80000]
}
ddf = pd.DataFrame(ddf)
imputer = KNNImputer(n_neighbors=5)
ddf.iloc[:, :] = imputer.fit_transform(ddf)
print(df_filled)

[[2.5e+01 5.0e+04]
 [3.0e+01 6.5e+04]
 [3.5e+01 6.0e+04]
 [4.5e+01 8.0e+04]]

In [87]:
ddf.head()

    Age   Salary
0  25.0  50000.0
1  30.0  65000.0
2  35.0  60000.0
3  45.0  80000.0

In [96]:
import numpy as np

# Generate sample data with outliers
dat = np.array([10, 12, 13, 15, 1000])
# Removing outliers using percentile method
filtered_data = dat[dat < np.percentile(dat, 95)]
filtered_data

array([10, 12, 13, 15])